module.exports = {
  title: '流程引擎原理与实践',
  description: '国内首本从工程角度系统性介绍流程引擎的技术体系',
  base: '/workflow-engine-book/',
  themeConfig: {
    logo: '/favicon.png',
    lastUpdated: '最后更新',
    nav: [
       {
          text: '目录',
          items: [
              {text: '1 引言', link: '/1-引言'},
              {text: '2 概念', link: '/2-概念'},
              {text: '3 流程建模和解析', link: '/3-流程建模和解析'},
              {text: '4 流程引擎的核心组件', link: '/4-流程引擎的核心组件'},
              {text: '5 事件驱动机制', link: '/5-事件驱动机制'},
              {text: '6 核心表结构与接口设计', link: '/6-核心表结构与接口设计'},
              {text: '7 权限系统设计', link: '/7-权限系统设计'},
              {text: '8 分布式Crontab任务调度', link: '/8-分布式Crontab任务调度'},
              {text: '9 流程分析', link: '/9-流程分析'},
              {text: '10 云原生工作流', link: '/10-云原生工作流'},
              {text: '11 多引擎分布式系统实现', link: '/11-多引擎分布式系统实现'}
          ]
      },
      // { text: '目录', link: '/目录/' },
      { text: 'Github', link: 'https://github.com/guanchao' },
    ],
    sidebar: [
      {
        title: '第一部份：流程引擎基础',   // 必要的
        collapsable: true, // 可选的, 默认值是 true,
        sidebarDepth: 2,    // 可选的, 默认值是 1
        children: [
          ['1-引言', '1 引言'],
          ['2-概念', '2 概念'],
          {
            title: '3 流程建模和解析',
            //collapsable: false, // 可选的, 默认值是 true,
            //sidebarDepth: 2,    // 可选的, 默认值是 1
            children: [
              ['3.1-流程建模语言发展概述', '3.1 流程建模语言发展概述'],
              ['3.2-流程建模', '3.2 流程建模'],
              ['3.3-生命周期', '3.3 生命周期'],
              ['3.4-流程模型的解析', '3.4 流程模型的解析'],
              ['3.5-与BPMN的比较', '3.5 与BPMN的比较']
            ]
          },
      ]
      },
      {
        title: '第二部份：流程引擎实现',
        children: [
          {
            title: '4 流程引擎的核心组件',
            children: [
              ['4.1-WFMC工作流参考模型', '4.1 WFMC工作流参考模型'],
              {
                title: '4.2 任务调度机制',
                children: [
                  ['4.2.1-DAG调度算法原理与实践', '4.2.1 DAG调度算法原理与实践'],
                  ['4.2.2-开源Airflow DAG调度算法剖析', '4.2.2 开源Airflow DAG调度算法剖析'],
                  ['4.2.3-FSM调度算法原理与实践', '4.2.3 FSM调度算法原理与实践'],
                  ['4.2.4-开源OSWorkflow FSM调度算法剖析', '4.2.4 开源OSWorkflow FSM调度算法剖析'],
                  ['4.2.5-Petri网调度算法原理与实践', '4.2.5 Petri网调度算法原理与实践'],
                  ['4.2.6-开源YAWL Petri网调度算法剖析', '4.2.6 开源YAWL Petri网调度算法剖析'],

                ]
              },
            ]
          },
          ['4.3-工作流模式-控制流模式', '4.3 工作流模式-控制流模式'],
          ['4.4-资源调度机制-资源模式', '4.4 资源调度机制-资源模式'], 
          ['4.5-数据管理机制-数据模式', '4.5 数据管理机制-数据模式'],
          ['4.6-异常处理机制-异常处理模式', '4.6 异常处理机制-异常处理模式'],
          ['4.7-引擎执行模式', '4.7 引擎执行模式'],
          {
            title: '5 事件驱动机制',
            children: [
              ['5.1-事件驱动架构', '5.1 事件驱动架构'],
              ['5.2-基于Redis的轻量级综合实践', '5.2 基于Redis的轻量级综合实践'],
              ['5.3-基于Kafka的高性能综合实践', '5.3 基于Kafka的高性能综合实践']
            ]
          },
          {
            title: '6 核心表结构与接口设计',
            children: [
              ['6.1-核心表结构', '6.1 核心表结构'],
              ['6.2-核心接口', '6.2 核心接口'],
            ]
          },
          ['7-权限系统设计', '7 权限系统设计'],
          ['8-分布式Crontab任务调度', '8 分布式Crontab任务调度']
        ],
      },
      {
        title: '第三部份：流程引擎进阶',   // 必要的
        //collapsable: false, // 可选的, 默认值是 true,
        //sidebarDepth: 2,    // 可选的, 默认值是 1
        children: [
          
          ['9-流程分析', '9 流程分析'],
          ['10-云原生工作流', '10 云原生工作流'],
           {
            title: '11 多引擎分布式系统实现',
            children: [
              ['11.1-系统架构', '11.1 系统架构'],
              ['11.2-分布式系统的基础理论', '11.2 分布式系统的基础理论'],
              {
                title: '11.3 高并发与高性能',
                children: [
                  ['11.3.1-数据库优化技术', '11.3.1 数据库优化技术'],
                  ['11.3.2-全局唯一ID生成器', '11.3.2 全局唯一ID生成器'],
                  ['11.3.3-缓存技术', '11.3.3 缓存技术'],
                  ['11.3.4-异步化技术', '11.3.4 异步化技术'],
                  ['11.3.5-池化技术', '11.3.5 池化技术'],
                  ['11.3.6-Linux参数优化', '11.3.6 Linux参数优化']
                ]
              },
              {
                title: '11.4 高可用与稳定性',
                children: [
                  ['11.4.1-限流', '11.4.1 限流'],
                  ['11.4.2-降级和熔断', '11.4.2 降级和熔断'],
                  ['11.4.3-故障转移', '11.4.3 故障转移'],
                  ['11.4.4-分布式锁', '11.4.4 分布式锁']
                ]
              },
            ]
          },
        ]
      },
    ]
  }
}
